tiborsimon/embedded-tdd-headers/pic/pic18/pic18f86j60_tdd.h
#define LATD0                         522
#define LD0                           523
#define LATD1                         524
#define LD1                           525
#define LATD2                         526
#define LD2                           527
#define LATE                          528
#define LATE0                         529
#define LE0                           530
#define LATE1                         531
#define LE1                           532
#define LATE2                         533
#define LE2                           534
#define LATE3                         535
#define LE3                           536
#define LATE4                         537
#define LE4                           538
#define LATE5                         539
#define LE5                           540
#define LATE6                         541
#define LE6                           542
#define LATE7                         543
#define LE7                           544
#define LATF                          545
#define LATF1                         546
#define LF1                           547
#define LF2                           548
#define LATF2                         549
#define LF3                           550
#define LATF3                         551
#define LF4                           552
#define LATF4                         553
#define LF5                           554
#define LATF5                         555
#define LF6                           556
#define LATF6                         557
#define LF7                           558
#define LATF7                         559
#define LATG                          560
#define LATG0                         561
#define LG0                           562
#define LATG1                         563
#define LG1                           564
#define LATG2                         565
#define LG2                           566
#define LATG3                         567
#define LG3                           568
#define LATG4                         569
#define LG4                           570
#define LATH                          571
#define LH0                           572
#define LATH0                         573
#define LH1                           574
#define LATH1                         575
#define LH2                           576
#define LATH2                         577
#define LH3                           578
#define LATH3                         579
#define LH4                           580
#define LATH4                         581
#define LH5                           582
#define LATH5                         583
#define LH6                           584
#define LATH6                         585
#define LH7                           586
#define LATH7                         587
#define LATJ                          588
#define LATJ4                         589
#define LJ4                           590
#define LATJ5                         591
#define LJ5                           592
#define TRISA                         593
#define TRISA_RA0                     594
#define TRISA0                        595
#define TRISA_RA1                     596
#define TRISA1                        597
#define TRISA2                        598
#define TRISA_RA2                     599
#define TRISA_RA3                     600
#define TRISA3                        601
#define TRISA_RA4                     602
#define TRISA4                        603
#define TRISA_RA5                     604
#define TRISA5                        605
#define TRISB                         606
#define TRISB_RB0                     607
#define TRISB0                        608
#define TRISB_RB1                     609
#define TRISB1                        610
#define TRISB_RB2                     611
#define TRISB2                        612
#define TRISB_RB3                     613
#define TRISB3                        614
#define TRISB_RB4                     615
#define TRISB4                        616
#define TRISB_RB5                     617
#define TRISB5                        618
#define TRISB_RB6                     619
#define TRISB6                        620
#define TRISB_RB7                     621
#define TRISB7                        622
#define TRISC                         623
#define TRISC0                        624
#define TRISC_RC0                     625
#define TRISC1                        626
#define TRISC_RC1                     627
#define TRISC2                        628
#define TRISC_RC2                     629
#define TRISC3                        630
#define TRISC_RC3                     631
#define TRISC4                        632
#define TRISC_RC4                     633
#define TRISC5                        634
#define TRISC_RC5                     635
#define TRISC6                        636
#define TRISC_RC6                     637
#define TRISC7                        638
#define TRISC_RC7                     639
#define TRISD                         640
#define TRISD0                        641
#define TRISD_RD0                     642
#define TRISD1                        643
#define TRISD_RD1                     644
#define TRISD2                        645
#define TRISD_RD2                     646
#define TRISE                         647
#define TRISE_RE0                     648
#define TRISE0                        649
#define TRISE1                        650
#define TRISE_RE1                     651
#define TRISE2                        652
#define TRISE_RE2                     653
#define TRISE_RE3                     654
#define TRISE3                        655
#define TRISE_RE4                     656
#define TRISE4                        657
#define TRISE_RE5                     658
#define TRISE5                        659
#define TRISE_RE6                     660
#define TRISE6                        661
#define TRISE_RE7                     662
#define TRISE7                        663
#define TRISF                         664
#define TRISF_RF1                     665
#define TRISF1                        666
#define TRISF2                        667
#define TRISF_RF2                     668
#define TRISF_RF3                     669
#define TRISF3                        670
#define TRISF_RF4                     671
#define TRISF4                        672
#define TRISF_RF5                     673
#define TRISF5                        674
#define TRISF_RF6                     675
#define TRISF6                        676
#define TRISF7                        677
#define TRISF_RF7                     678
#define TRISG                         679
#define TRISG0                        680
#define TRISG_RG0                     681
#define TRISG1                        682
#define TRISG_RG1                     683
#define TRISG2                        684
#define TRISG_RG2                     685
#define TRISG_RG3                     686
#define TRISG3                        687
#define TRISG4                        688
#define TRISG_RG4                     689
#define TRISH                         690
#define TRISH_RH0                     691
#define TRISH0                        692
#define TRISH_RH1                     693
#define TRISH1                        694
#define TRISH_RH2                     695
#define TRISH2                        696
#define TRISH_RH3                     697
#define TRISH3                        698
#define TRISH_RH4                     699
#define TRISH4                        700
#define TRISH_RH5                     701
#define TRISH5                        702
#define TRISH_RH6                     703
#define TRISH6                        704
#define TRISH_RH7                     705
#define TRISH7                        706
#define TRISJ                         707
#define TRISJ_RJ4                     708
#define TRISJ4                        709
#define TRISJ_RJ5                     710
#define TRISJ5                        711
#define OSCTUNE                       712
#define TUN4                          713
#define PPRE                          714
#define TUN5                          715
#define PPST0                         716
#define PLLEN                         717
#define PPST1                         718
#define PIE1                          719
#define TMR1IE                        720
#define TMR2IE                        721
#define CCP1IE                        722
#define SSP1IE                        723
#define SSPIE                         724
#define PIE1_TXIE                     725
#define TX1IE                         726
#define RC1IE                         727
#define RCIE                          728
#define ADIE                          729
#define PIR1                          730
#define TMR1IF                        731
#define TMR2IF                        732
#define CCP1IF                        733
#define SSPIF                         734
#define SSP1IF                        735
#define PIR1_TXIF                     736
#define TX1IF                         737
#define RCIF                          738
#define RC1IF                         739
#define ADIF                          740
#define IPR1                          741
#define TMR1IP                        742
#define TMR2IP                        743
#define CCP1IP                        744
#define SSPIP                         745
#define SSP1IP                        746
#define TX1IP                         747
#define TXIP                          748
#define RCIP                          749
#define RC1IP                         750
#define ADIP                          751
#define PIE2                          752
#define CCP2IE                        753
#define TMR3IE                        754
#define BCL1IE                        755
#define BCLIE                         756
#define ETHIE                         757
#define CMIE                          758
#define OSCFIE                        759
#define PIR2                          760
#define CCP2IF                        761
#define TMR3IF                        762
#define BCL1IF                        763
#define BCLIF                         764
#define ETHIF                         765
#define CMIF                          766
#define OSCFIF                        767
#define IPR2                          768
#define CCP2IP                        769
#define TMR3IP                        770
#define BCLIP                         771
#define BCL1IP                        772
#define ETHIP                         773
#define CMIP                          774
#define OSCFIP                        775
#define PIE3                          776
#define CCP3IE                        777
#define RXB0IE                        778
#define RXBNIE                        779
#define RXB1IE                        780
#define CCP4IE                        781
#define TXB0IE                        782
#define CCP5IE                        783
#define TMR4IE                        784
#define TXB1IE                        785
#define TXB2IE                        786
#define TXBNIE                        787
#define TX2IE                         788
#define RC2IE                         789
#define PIR3                          790
#define CCP3IF                        791
#define RXBNIF                        792
#define CCP4IF                        793
#define CCP5IF                        794
#define TMR4IF                        795
#define TXBNIF                        796
#define TX2IF                         797
#define RC2IF                         798
#define IPR3                          799
#define CCP3IP                        800
#define CCP4IP                        801
#define RXBNIP                        802
#define CCP5IP                        803
#define TMR4IP                        804
#define TX2IP                         805
#define TXBNIP                        806
#define RC2IP                         807
#define EECON1                        808
#define WR                            809
#define WREN                          810
#define WRERR                         811
#define FREE                          812
#define RCSTA1                        813
#define RCSTA1_RX9D                   814
#define RX9D1                         815
#define RCSTA1_RCD8                   816
#define RCSTA1_OERR                   817
#define OERR1                         818
#define RCSTA1_FERR                   819
#define FERR1                         820
#define RCSTA1_ADDEN                  821
#define ADDEN1                        822
#define RCSTA1_CREN                   823
#define CREN1                         824
#define SRENA                         825
#define SREN1                         826
#define RCSTA1_SREN                   827
#define RCSTA1_NOT_RC8                828
#define RCSTA1_RC9                    829
#define RCSTA1_nRC8                   830
#define RCSTA1_RC8_9                  831
#define RCSTA1_RX9                    832
#define RX91                          833
#define RCSTA1_SPEN                   834
#define SPEN1                         835
#define TXSTA1                        836
#define TX9D1                         837
#define TXSTA1_TX9D                   838
#define TXSTA1_TXD8                   839
#define TRMT1                         840
#define TXSTA1_TRMT                   841
#define BRGH1                         842
#define TXSTA1_BRGH                   843
#define TXSTA1_SENDB                  844
#define SENDB1                        845
#define TXSTA1_SYNC                   846
#define SYNC1                         847
#define TXEN1                         848
#define TXSTA1_TXEN                   849
#define TX91                          850
#define TXSTA1_NOT_TX8                851
#define TXSTA1_TX8_9                  852
#define TXSTA1_TX9                    853
#define TXSTA1_nTX8                   854
#define TXSTA1_CSRC                   855
#define CSRC1                         856
#define T3CON                         857
#define TMR3ON                        858
#define TMR3CS                        859
#define nT3SYNC                       860
#define NOT_T3SYNC                    861
#define T3SYNC                        862
#define T3INSYNC                      863
#define SOSCEN3                       864
#define T3CCP1                        865
#define T3CKPS                        866
#define T3CKPS0                       867
#define T3CKPS1                       868
#define T3CCP2                        869
#define T3CON_RD16                    870
#define RD163                         871
#define T3RD16                        872
#define CMCON                         873
#define CMCON_CM                      874
#define CMEN0                         875
#define CM0                           876
#define CMEN1                         877
#define CM1                           878
#define CMEN2                         879
#define CM2                           880
#define CIS                           881
#define C1INV                         882
#define C2INV                         883
#define C1OUT                         884
#define C2OUT                         885
#define CVRCON                        886
#define CVR                           887
#define CVR0                          888
#define CVR1                          889
#define CVR2                          890
#define CVR3                          891
#define CVRSS                         892
#define CVRR                          893
#define CVROEN                        894
#define CVROE                         895
#define CVREN                         896
#define ECCP1AS                       897
#define ECCP1AS_PSSBD                 898
#define ECCP1AS_PSSBD0                899
#define PSS1BD0                       900
#define ECCP1AS_PSSBD1                901
#define PSS1BD1                       902
#define ECCP1AS_PSSAC0                903
#define PSS1AC0                       904
#define ECCP1AS_PSSAC                 905
#define ECCP1AS_PSSAC1                906
#define PSS1AC1                       907
#define ECCP1AS_ECCPAS0               908
#define ECCP1AS_ECCPAS                909
#define ECCP1AS0                      910
#define ECCP1AS_ECCPAS1               911
#define ECCP1AS1                      912
#define ECCP1AS_ECCPAS2               913
#define ECCP1AS2                      914
#define ECCP1ASE                      915
#define ECCP1AS_ECCPASE               916
#define CCP3CON                       917
#define CCP3M                         918
#define CCP3M0                        919
#define CCP3M1                        920
#define CCP3M2                        921
#define CCP3M3                        922
#define CCP3Y                         923
#define DC3B                          924
#define DC3B0                         925
#define DC3B1                         926
#define CCP3X                         927
#define P3M                           928
#define P3M0                          929
#define P3M1                          930
#define CCP2CON                       931
#define CCP2M                         932
#define CCP2M0                        933
#define CCP2M1                        934
#define CCP2M2                        935
#define CCP2M3                        936
#define DC2B                          937
#define DC2B0                         938
#define CCP2Y                         939
#define DC2B1                         940
#define CCP2X                         941
#define P2M                           942
#define P2M0                          943
#define P2M1                          944
#define CCP1CON                       945
#define CCP1M0                        946
#define CCP1M                         947
#define CCP1M1                        948
#define CCP1M2                        949
#define CCP1M3                        950
#define CCP1Y                         951
#define DC1B                          952
#define DC1B0                         953
#define CCP1X                         954
#define DC1B1                         955
#define P1M                           956
#define P1M0                          957
#define P1M1                          958
#define ADCON2                        959
#define ADCS0                         960
#define ADCS                          961
#define ADCS1                         962
#define ADCS2                         963
#define ACQT0                         964
#define ACQT                          965
#define ACQT1                         966
#define ACQT2                         967
#define ADFM                          968
#define ADCON1                        969
#define PCFG0                         970
#define PCFG                          971
#define PCFG1                         972
#define PCFG2                         973
#define CHSN3                         974
#define PCFG3                         975
#define VCFG                          976
#define VCFG0                         977
#define VCFG01                        978
#define VCFG11                        979
#define VCFG1                         980
#define ADCON0                        981
#define ADON                          982
#define nDONE                         983
#define GO_nDONE                      984
#define NOT_DONE                      985
#define GODONE                        986
#define GO_DONE                       987
#define DONE                          988
#define GO_NOT_DONE                   989
#define GO                            990
#define CHS0                          991
#define CHS                           992
#define CHS1                          993
#define CHS2                          994
#define CHS3                          995
#define ADCAL                         996
#define SSP1CON2                      997
#define SEN1                          998
#define SEN                           999
#define ADMSK11                       1000
#define ADMSK                         1001
#define RSEN1                         1002
#define RSEN                          1003
#define ADMSK1                        1004
#define PEN                           1005
#define ADMSK21                       1006
#define PEN1                          1007
#define ADMSK2                        1008
#define ADMSK31                       1009
#define RCEN                          1010
#define RCEN1                         1011
#define ADMSK3                        1012
#define ACKEN                         1013
#define ACKEN1                        1014
#define ADMSK41                       1015
#define ADMSK4                        1016
#define ACKDT1                        1017
#define ADMSK51                       1018
#define ADMSK5                        1019
#define ACKDT                         1020
#define ACKSTAT                       1021
#define ACKSTAT1                      1022
#define GCEN                          1023
#define GCEN1                         1024
#define SSP1CON1                      1025
#define SSPM0                         1026
#define SSPM                          1027
#define SSPM01                        1028
#define SSPM1                         1029
#define SSPM11                        1030
#define SSPM2                         1031
#define SSPM21                        1032
#define SSPM31                        1033
#define SSPM3                         1034
#define CKP                           1035
#define CKP1                          1036
#define SSPEN                         1037
#define SSPEN1                        1038
#define SSPOV1                        1039
#define SSPOV                         1040
#define WCOL1                         1041
#define WCOL                          1042
#define SSP1STAT                      1043
#define BF                            1044
#define BF1                           1045
#define UA1                           1046
#define UA                            1047
#define R_NOT_W                       1048
#define READ_WRITE                    1049
#define RW1                           1050
#define NOT_W                         1051
#define R_W                           1052
#define nW                            1053
#define RW                            1054
#define nWRITE                        1055
#define R                             1056
#define NOT_WRITE                     1057
#define R_nW                          1058
#define I2C_READ                      1059
#define START                         1060
#define START1                        1061
#define S                             1062
#define I2C_START                     1063
#define STOP                          1064
#define STOP1                         1065
#define I2C_STOP                      1066
#define P                             1067
#define NOT_A                         1068
#define DATA_ADDRESS                  1069
#define nA                            1070
#define D_A                           1071
#define D_nA                          1072
#define D                             1073
#define DA1                           1074
#define DA                            1075
#define D_NOT_A                       1076
#define NOT_ADDRESS                   1077
#define nADDRESS                      1078
#define I2C_DAT                       1079
#define CKE                           1080
#define CKE1                          1081
#define SMP                           1082
#define SMP1                          1083
#define SSP1ADD                       1084
#define MSK01                         1085
#define MSK0                          1086
#define MSK11                         1087
#define MSK1                          1088
#define MSK21                         1089
#define MSK2                          1090
