tiborsimon/embedded-tdd-headers/pic/pic18/pic18f86j60_tdd.h
#define MSK3                          1091
#define MSK31                         1092
#define MSK4                          1093
#define MSK41                         1094
#define MSK51                         1095
#define MSK5                          1096
#define MSK61                         1097
#define MSK6                          1098
#define MSK71                         1099
#define MSK7                          1100
#define T2CON                         1101
#define T2CKPS0                       1102
#define T2CKPS                        1103
#define T2CKPS1                       1104
#define TMR2ON                        1105
#define T2OUTPS0                      1106
#define TOUTPS                        1107
#define T2OUTPS1                      1108
#define T2OUTPS2                      1109
#define T2OUTPS3                      1110
#define PR2                           1111
#define WM0                           1112
#define WM1                           1113
#define WAIT0                         1114
#define WAIT1                         1115
#define EBDIS                         1116
#define T1CON                         1117
#define TMR1ON                        1118
#define TMR1CS                        1119
#define NOT_T1SYNC                    1120
#define T1SYNC                        1121
#define nT1SYNC                       1122
#define T1INSYNC                      1123
#define T1OSCEN                       1124
#define SOSCEN                        1125
#define T1CKPS0                       1126
#define T1CKPS                        1127
#define T1CKPS1                       1128
#define T1RUN                         1129
#define T1RD16                        1130
#define T1CON_RD16                    1131
#define RCON                          1132
#define BOR                           1133
#define NOT_BOR                       1134
#define nBOR                          1135
#define POR                           1136
#define nPOR                          1137
#define NOT_POR                       1138
#define PD                            1139
#define nPD                           1140
#define NOT_PD                        1141
#define nTO                           1142
#define TO                            1143
#define NOT_TO                        1144
#define nRI                           1145
#define NOT_RI                        1146
#define RI                            1147
#define NOT_CM                        1148
#define RCON_CM                       1149
#define nCM                           1150
#define IPEN                          1151
#define WDTCON                        1152
#define SWDTE                         1153
#define SWDTEN                        1154
#define ECON1                         1155
#define RXEN                          1156
#define TXRTS                         1157
#define CSUMEN                        1158
#define DMAST                         1159
#define RXRST                         1160
#define TXRST                         1161
#define OSCCON                        1162
#define SCS0                          1163
#define SCS                           1164
#define SCS1                          1165
#define OSTS                          1166
#define IDLEN                         1167
#define T0CON                         1168
#define T0PS                          1169
#define T0PS0                         1170
#define T0PS1                         1171
#define T0PS2                         1172
#define PSA                           1173
#define T0SE                          1174
#define T0CS                          1175
#define T08BIT                        1176
#define TMR0ON                        1177
#define STATUS                        1178
#define C                             1179
#define CARRY                         1180
#define DC                            1181
#define ZERO                          1182
#define Z                             1183
#define OV                            1184
#define OVERFLOW                      1185
#define N                             1186
#define NEGATIVE                      1187
#define INTCON3                       1188
#define INT1IF                        1189
#define INT1F                         1190
#define INT2IF                        1191
#define INT2F                         1192
#define INT3F                         1193
#define INT3IF                        1194
#define INT1E                         1195
#define INT1IE                        1196
#define INT2IE                        1197
#define INT2E                         1198
#define INT3E                         1199
#define INT3IE                        1200
#define INT1P                         1201
#define INT1IP                        1202
#define INT2IP                        1203
#define INT2P                         1204
#define INTCON2                       1205
#define RBIP                          1206
#define INT3IP                        1207
#define TMR0IP                        1208
#define T0IP                          1209
#define INTEDG3                       1210
#define INTEDG2                       1211
#define INTEDG1                       1212
#define INTEDG0                       1213
#define RBPU                          1214
#define NOT_RBPU                      1215
#define nRBPU                         1216
#define INTCON                        1217
#define RBIF                          1218
#define INT0F                         1219
#define INT0IF                        1220
#define T0IF                          1221
#define TMR0IF                        1222
#define RBIE                          1223
#define INT0E                         1224
#define INT0IE                        1225
#define T0IE                          1226
#define TMR0IE                        1227
#define PEIE                          1228
#define PEIE_GIEL                     1229
#define GIEL                          1230
#define GIE_GIEH                      1231
#define GIE                           1232
#define GIEH                          1233
#define STKPTR0                       1234
#define STKPTR                        1235
#define SP0                           1236
#define STKPTR1                       1237
#define SP1                           1238
#define STKPTR2                       1239
#define SP2                           1240
#define SP3                           1241
#define STKPTR3                       1242
#define STKPTR4                       1243
#define SP4                           1244
#define STKUNF                        1245
#define STKOVF                        1246
#define STKFUL                        1247

#endif // _PIC18F86J60_H_
